//=============================================================================
//
// 雷雲処理[thundercloud.cpp]
// Author : masayasu wakita
//
//=============================================================================

//=============================================================================
//
// インクルードファイル
//
//=============================================================================
#include "thundercloud.h"

//=============================================================================
// コンストラクタ処理
//=============================================================================
CThunderCloud::CThunderCloud()
{

}

//=============================================================================
// デストラクタ処理
//=============================================================================
CThunderCloud::~CThunderCloud()
{
}

//=============================================================================
// 初期化処理
//=============================================================================
void CThunderCloud::Init(void)
{
	SetOffsetType(OFFSET_TYPE_VERTICAL_CENTER);
	SetCol(D3DCOLOR_RGBA(188, 0, 188, 255));
	SetSize(D3DXVECTOR3(100.0f, 100.0f, 0.0f));
	SetRot(D3DXVECTOR3(0.0f, rand() % (314) * 0.01f, 0.0f));
	CScene_THREE::Init();

	SetLighting(true);
	SetBillboard(true);
	SetAlphaBlend(true);
	SetZEneble(true);
	SetTexType(3);
}

//=============================================================================
// 終了処理
//=============================================================================
void CThunderCloud::Uninit(void)
{
	CScene_THREE::Uninit();
}

//=============================================================================
// 更新処理
//=============================================================================
void CThunderCloud::Update(void)
{
	CScene_THREE::Update();

	m_nLifeCount++;

	if (m_nLifeCount > 80)
	{
		Release();
	}
}

//=============================================================================
// 描画処理
//=============================================================================
void CThunderCloud::Draw(void)
{
	// 変数宣言
	CRenderer *pRenderer = CManager::GetRenderer();	// レンダラーの取得

	pRenderer->SetBlend(CRenderer::BLEND_ADD_TRANSLUCENT);
	CScene_THREE::Draw();
	pRenderer->SetBlend(CRenderer::BLEND_TRANSLUCENT);
}

//=============================================================================
// 生成
//=============================================================================
CThunderCloud * CThunderCloud::Create(D3DXVECTOR3 pos)
{
	CThunderCloud *pThunderCloud = new CThunderCloud();

	if (pThunderCloud != NULL)
	{
		pThunderCloud->ManageSetting(CScene::LAYER_PARTICLE);
		pThunderCloud->Init();
		pThunderCloud->SetPos(pos);
	}
	return NULL;
}

#ifdef _DEBUG
//=============================================================================
// デバッグ表示
//=============================================================================
void CThunderCloud::Debug(void)
{

}
#endif // _DEBUG

//=============================================================================
// 読み込み処理
//=============================================================================
HRESULT CThunderCloud::Load(void)
{
	return S_OK;
}

//=============================================================================
// 読み込んだ情報を破棄
//=============================================================================
void CThunderCloud::UnLoad(void)
{
}