//=============================================================================
//
// タイトルの処理 [title.h]
// Author : Ryouma Inoue
//
//=============================================================================
#ifndef _TITLE_H_
#define _TITLE_H_

#include "main.h"

//=============================================================================
// 前方宣言	( ポインタだけなら使える )
//=============================================================================
class CScene_TWO;

//=============================================================================
// 管理クラス
//=============================================================================
class CTitle
{
public:

	CTitle();													// コンストラクタ
	~CTitle();													// デストラクタ

	HRESULT Init();												// 初期化
	void	Uninit(void);										// 終了
	void	Update(void);										// 更新
	void	Draw(void);											// 描画

	static  CTitle		*Create(void);							// タイトルの生成

private:
	CScene_TWO *m_pCloudBack;
	float m_fScroll;
};
#endif
