//=============================================================================
//
// チュートリアルの処理 [tutorial.h]
// Author : Ryouma Inoue
//
//=============================================================================
#ifndef _TUTORIAL_H_
#define _TUTORIAL_H_

#include "main.h"

//=============================================================================
// 前方宣言	( ポインタだけなら使える )
//=============================================================================

//=============================================================================
// 管理クラス
//=============================================================================
class CTutorial
{
public:

	CTutorial();													// コンストラクタ
	~CTutorial();													// デストラクタ

	HRESULT Init();												// 初期化
	void	Uninit(void);										// 終了
	void	Update(void);										// 更新
	void	Draw(void);											// 描画

	static  CTutorial		*Create(void);							// タイトルの生成

private:
};
#endif
